#######################################################################################################################
# Выполнил: Иван Суханюк(Курс: Intro Python (07.04.2020))
# Последние изменения: 05.05.2020
#  -> task 1: Модифицируйте класс Dot следующим образом:
#   - обеспечьте проверку значений координат (только числа)
#   - добавьте метод __str__, который бы отдавал информацию о точке в фрмате "x: 10, y: 20"
# -> task 2: Модифицируйте класс Line следующим образом:
#   - обеспечьте проверку точек начала и конца (точки начала и конца отрезка не должны совпадать)
#   - модифицируйте метод __str__ так чтобы он отдавал информацию в формате
#       ("Line with points [информация о точке начала] [информация о точке конца] and length [длина]")
# -> task 3: Напишите декоратор, замеряющий время выполнения функции
# -> *task 4: Модифицируйте декоратор таким образом, чтобы декоратор вместе с ответом функции возвращал строку,
#   содержащую информацию о затраченном на выполнение времени. Формат возвращаемого времени
#   - H-MM-SS-MS (часы-минуты-секунды-милисекунды)
######################################################################################################################
