#######################################################################################################################
# Выполнил: Иван Суханюк(Курс: Intro Python (07.04.2020))
# Последние изменения: 22.05.2020
#  -> task 1: Подключитесь к API НБУ (описание API - https://old.bank.gov.ua/doccatalog/document?id=72819047) с помошью
#   функции, получите текущий курс валют. Функция должна вернуть данные в таком виде:
#
#       "дата создания запроса"
#       1 - "название ввалюты1" -- "курс"
#       2 - "название ввалюты2" -- "курс"
#       3 - "название ввалюты3" -- "курс"
#       ...
#       так все валюты, которые придут
#
# -> *task 2: Запишите полученные данные в файл в таком же виде
# -> **task 3: Пользователь вводит название валюты и дату, программа возвращает пользователю курс гривны к этой
#   валюте за указаную дату используя API НБУ. Если на такую дату курса нет - возвращает какойнибудь информативный
#   ответ. Формат ввода пользователем данных - на ваше усмотрение. Реализовать с помощью ООП!
######################################################################################################################


























